{
    "pagination": {
        "last_visible_page": 7050,
        "has_next_page": true,
        "current_page": 1,
        "items": {
            "count": 10,
            "total": 70493,
            "per_page": 10
        }
    },
    "data": [
        {
            "mal_id": 417,
            "url": "https://myanimelist.net/character/417/Lelouch_Lamperouge",
            "images": {
                "jpg": {
                    "image_url": "https://cdn.myanimelist.net/images/characters/8/406163.jpg"
                },
                "webp": {
                    "image_url": "https://cdn.myanimelist.net/images/characters/8/406163.webp",
                    "small_image_url": "https://cdn.myanimelist.net/images/characters/8/406163t.webp"
                }
            },
            "name": "Lelouch Lamperouge",
            "name_kanji": "ルルーシュ・ランペルージ",
            "nicknames": [
                "Lelouch vi Britannia",
                "Zero",
                "Lulu",
                "Black Prince",
                "The Demon Emperor"
            ],
            "favorites": 167768,
            "about": "Age: 17 (first season), 18 (second season)\nBirthdate:  December 5, 1999 a.t.b. (Sagittarius)\nBlood Type: A\nNationality: Britannia\nHeight: 178 cm (5'10\")\nOccupation: Student, Terrorist, Knightmare Pilot, Politician, Emperor, Prince\nAllegiance: Order of the Black Knights\nPosition: Leader of the Black Knights\nKnightmare: Sutherland, Burai, Gawain, Shinkirou\n\nLelouch is the main protagonist of the anime/manga series Code Geass. He is the Eleventh Prince of the Holy Britannian Empire and the son of the 98th Emperor of Britannia, Charles zi Britannia.\n\nLelouch is a very clever individual who is also calm, sophisticated, and arrogant due to his aristocratic upbringing. While at school, Lelouch conducts himself as a friendly, likable, and often an easygoing student. However, this is a mask to hide his true nature. While as Zero, his true nature is expressed. His charisma and beliefs in justice gain him the trust and respect of many soldiers and leaders.\n\nHe is known for having a very stoic personality. He never cared about schoolwork, seeing the entire thing as trivial, even though his high intelligence would make it easy for him. He enjoys seeking out challenges, often playing chess against the nobility. In general, Lelouch takes most day-to-day affairs with open disinterest, often not even noticing the affection of others, especially Shirley, his classmate. He has a strong dislike for nobles, viewing them as tepid and \"overprivileged parasites.\"\n\nMany characters have noted that Lelouch is entirely selfish, as his desire to remake the world into what he wants it to become from his desire to avenge his mother's apparent death and Nunnally's sake. However, in time, he realizes that this goal is not just for them but also the entire world.\n\nDespite his cold, calculating demeanor and ruthlessness in battle, he can be a rather compassionate person to his friends and loved ones. To Nunnally, he is a loving older brother, and to Suzaku, a loyal friend, although the two are enemies. Lelouch, at first glance, seems to have relatively little concern for the well-being of his subordinates, but in reality, he does care about them, seeing them as valuable allies.\n\n\nBackground (as Lelouch):\n\nBackground (as Zero):\n\nFirst Season:\n\nSecond Season:\n\n\nGeass:\nLelouch's Geass, bestowed upon him by C.C., gives him \"The Power of Absolute Obedience,\" allowing him to plant commands within a person's mind upon eye contact in a manner comparable to hypnosis. Activation of his Geass is visually represented by the manifestation of a Geass Sigil in his left eye. Commands dictated are written into the minds of the designated targets, the Sigil projecting him from his eye to theirs.\n\n\nOf all the Geass abilities in the series, Lelouch's has been explored the most and also seems to have the most restrictions, and side effects of any Geass introduced:(Source: Code Geass Wiki, Villains Wiki, Heroes Wiki, Anime and Manga Universe Wiki)"
        },
        {
            "mal_id": 45627,
            "url": "https://myanimelist.net/character/45627/Levi",
            "images": {
                "jpg": {
                    "image_url": "https://cdn.myanimelist.net/images/characters/2/241413.jpg"
                },
                "webp": {
                    "image_url": "https://cdn.myanimelist.net/images/characters/2/241413.webp",
                    "small_image_url": "https://cdn.myanimelist.net/images/characters/2/241413t.webp"
                }
            },
            "name": "Levi",
            "name_kanji": "リヴァイ",
            "nicknames": [],
            "favorites": 140023,
            "about": "Birthday: December 25\nHeight: 160 cm (5'3\")\nWeight: 65 kg (143 lbs)\nAffiliations: Scouting Legion, Special Operations Squad\n\nLevi is known as humanity's most powerful soldier. He's ranked as Captain of the Scouting Legion division. Levi is also the leader of the Special Operations Squad, an elite team that he hand-picked in order to protect Eren Yeager. While it is said that he is blunt and unapproachable, it is noted that he has a strong respect for structure and discipline. There are rumors that he was originally part of underground crime before he became a soldier. Although he often appears to be unfriendly, he cares deeply for his team and has never undervalued human life. He is also a notorious clean-freak.\n\n\nNote: Levi is the official English translation by Kodansha."
        },
        {
            "mal_id": 40,
            "url": "https://myanimelist.net/character/40/Luffy_Monkey_D",
            "images": {
                "jpg": {
                    "image_url": "https://cdn.myanimelist.net/images/characters/9/310307.jpg"
                },
                "webp": {
                    "image_url": "https://cdn.myanimelist.net/images/characters/9/310307.webp",
                    "small_image_url": "https://cdn.myanimelist.net/images/characters/9/310307t.webp"
                }
            },
            "name": "Luffy Monkey D.",
            "name_kanji": "モンキー・D・ルフィ",
            "nicknames": [
                "Mugiwara",
                "Straw Hat",
                "Lucy",
                "Luffytaro",
                "Nightmare Luffy"
            ],
            "favorites": 136431,
            "about": "Age: 17; 19\nBirthdate: May 5, Taurus\nHeight: 172 cm; 174 cm\nBlood type: F\nAffiliation: Straw Hat Pirates\nPosition: Captain\nDevil fruit: Gomu Gomu no Mi (Gum Gum Fruit)\nType: Paramecia \nBounty:\nLuffy is the captain of the Straw Hat Pirates and is best friends with all of them and values them over all else. At first glance, Luffy does not appear to be very intelligent, often seeing things in a childish manner and can easily be amazed by the simplest things. However, because he views the world in a straightforward and simple manner, he is occasionally the only person who can see past the events and see what should be done.\n\nLuffy seems to have an unstoppable appetite, a characteristic that is common to the Japanese archetype of the (at times simple-minded) young male hero/adventurer with a heart of gold; perhaps the hunger more so in Luffy's case due to having an elastic stomach. Luffy is also another one of the several characters given the middle initial \"D.\"\n\nAlthough Luffy is fairly lightheaded and a funny character, he has an unstoppable sense of determination, optimism, and commitment and will do anything to stand up for his friends and comrades. Along with that, he has great courage to back it up as well as unbelievable strength. Ever since consuming the devil fruit he was shown to be not worried about his inability to swim, much like his brother. Much of these traits are common among D's. His only display of true fear is towards his grandfather, to the point that he is intimidated at the mere mention of him.\n\nLuffy never kills any of his enemies, no matter how cold-hearted they are; instead, he frequently sends the villain flying, knocking them out or beating them to a point that they are almost near death, which results in some of the villains searching for revenge, such as Buggy the Clown and Alvida. Oda explains that it's not a question of morality so much as a matter of punishing the villains for their crimes - he feels that killing the villains lets them off too lightly, whereas he considers letting them live to see their dreams be ruined a far more fitting punishment.\n\nLuffy's dream is to find the One Piece and become Pirate King. He knows that to achieve his goal, he will have to defeat many strong opponents, including the World Government and his childhood hero Shanks."
        },
        {
            "mal_id": 71,
            "url": "https://myanimelist.net/character/71/L_Lawliet",
            "images": {
                "jpg": {
                    "image_url": "https://cdn.myanimelist.net/images/characters/10/249647.jpg"
                },
                "webp": {
                    "image_url": "https://cdn.myanimelist.net/images/characters/10/249647.webp",
                    "small_image_url": "https://cdn.myanimelist.net/images/characters/10/249647t.webp"
                }
            },
            "name": "L Lawliet",
            "name_kanji": "エル ローライト",
            "nicknames": [
                "Ryuga Hideki",
                "Ryuzaki",
                "Eraldo Coil",
                "Deneuve"
            ],
            "favorites": 125791,
            "about": "Birthday: October 31, 1979 (1982 in anime)\nZodiac sign: Scorpio\nHeight: 179 cm (5'10\")\nWeight: 50 kg (110 lbs.)\nLikes: sweets\nDislikes: Wearing socks\n\nL, who also uses the aliases Hideki Ryuga, Ryuzaki, Eraldo Coil and Deneuve, the latter two for which he has developed reputations as the second—and third—best detectives in the world, is quite secretive and only communicates with the world through his assistant Watari. He never shows his face to the world, instead of representing himself with a capital L in Cloister Black font. After meeting the Kira investigation team, he requests that the task force refers to him as Ryuzaki for discretion. The Kira investigation team never learns his true name.\n\nL's disheveled and languid appearance masks his great powers of deduction and insight. He tends to second-guess everything he is presented with and is extremely meticulous and analytical. He has several quirks such as preferring to crouch rather than sit, eating only sweet foods like desserts and fruits, and holding items very delicately. He stayed in England for five years, and during that time he was the champion in tennis for the England Junior Cup.\n\nL suggests that even though he eats only sweet foods, he remains underweight because the brain uses the most calories of any organ in the body. He also says that if he sits normally, his reasoning ability would drop 40%.\n\n(Source: Wikipedia, Death Note Profiles)"
        },
        {
            "mal_id": 62,
            "url": "https://myanimelist.net/character/62/Zoro_Roronoa",
            "images": {
                "jpg": {
                    "image_url": "https://cdn.myanimelist.net/images/characters/3/100534.jpg"
                },
                "webp": {
                    "image_url": "https://cdn.myanimelist.net/images/characters/3/100534.webp",
                    "small_image_url": "https://cdn.myanimelist.net/images/characters/3/100534t.webp"
                }
            },
            "name": "Zoro Roronoa",
            "name_kanji": "ロロノア・ゾロ",
            "nicknames": [
                "Pirate Hunter",
                "Marimo",
                "Zorojuro",
                "King Of Hell"
            ],
            "favorites": 108535,
            "about": "Age: 19; 21\nBirthdate: November 11, Scorpio \nHeight: 178 cm (5'10\") , 181 (5'11\") (after timeskip)\nAffiliation: Straw Hat Pirates\nPosition: Swordsman\nDevil Fruit: None\nBounty: \nZoro was the first crew member to be recruited by Luffy. Zoro is a skilled swordsman who fights with his own unique sword style known as santoryu (three katana fighting style). This is achieved by using one katana in each hand and another in his mouth. He is also seen fighting with only one or two swords. When in a serious fight he ties his bandana, normally tied on the arm, on his head.\n\nThough not a samurai, he appears to maintain a certain degree of bushido, and is frequently mistaken for one. Unlike Luffy and most of the other Straw Hat pirates, Zoro has been known to kill his opponents if he has to, though never in cold blood.\n\nZoro has a stern, serious and distanced personality, but, unlike Robin, he often reacts in a goofy and exaggerated comic style due to his gruff, impatient attitude. On the ship, he normally either trains with weights or sleeps. The only work he is seen doing regularly is hoisting the anchor using his great strength. He also likes sake, almost to the degree that Luffy likes meat, but like Nami, he never gets drunk due to his inhumanly-high endurance and tolerance for alcohol. Another notable trait is his lack of orientation, as Zoro often gets lost, even in small, familiar spaces or when being led by someone. Despite this, he is often the first to sense an enemy or danger, and the first to react. He is often displayed being well aware of dangerous situations and people around him.\n\nZoro often also reminds others of the harsh facts, which often shocks some of the other crew members, although they usually decide he is right. Zoro has also stated that he is an atheist, and has never believed in anything except himself. He often comes across as arrogant and overconfident, but only because he knows he's a strong man with great fighting ability. Even so, Zoro knows that he still has a lot of untapped potential, and is constantly seen training and trying to improve his fighting skills. He also adheres to a strict sword master's code of honor, and never falsely brags or lies about his abilities, sometimes outright admitting a weakness, even to an enemy. He also never tries to escape from a fight or use trickery to win, believing that doing so is cowardly and scorning anyone who uses such tactics. Zoro is very vigorous, strong-willed, and determined."
        },
        {
            "mal_id": 80,
            "url": "https://myanimelist.net/character/80/Light_Yagami",
            "images": {
                "jpg": {
                    "image_url": "https://cdn.myanimelist.net/images/characters/6/63870.jpg"
                },
                "webp": {
                    "image_url": "https://cdn.myanimelist.net/images/characters/6/63870.webp",
                    "small_image_url": "https://cdn.myanimelist.net/images/characters/6/63870t.webp"
                }
            },
            "name": "Light Yagami",
            "name_kanji": "夜神 月",
            "nicknames": [
                "Kira",
                "God of the New World"
            ],
            "favorites": 95606,
            "about": "Birthdate: February 28, 1986 (1989 in the anime)\nZodiac sign: Pisces\nHair color: Brown\nEye color: Brown\nHeight: 179 cm (5'10\")\nWeight: 64.1 kg (141 lbs.)\nBlood type: A\nOccupation: high school student, a university student, detective\nAge (during the series): 17-23\nLikes: Justice\nDislikes: Evil\n\nLight, born on February 28, 1986, is a third-year high school student (12th grade) at Daikoku Private Academy (大国学園, Daikoku Gakuen) who also attends supplemental classes at Gamou Prep Academy at the beginning of the story. Light has a father, Soichiro Yagami, who is the head of the Police Force. Light also has a mother, Sachiko Yagami, and a younger sister, Sayu Yagami.\n\nIn Spring 2004, Light becomes a first-year student (freshman) at To-Oh University (東応大学, Tōō Daigaku), becoming one of two freshman representatives; L is the other freshman representative. During a tennis game with L at To-Oh, spectators reveal that Light was the junior high school tennis champion in 1999 and 2000. After his 2000 victory, Light quit tennis as he entered high school.\n\nYagami Light is a brilliant college student. Nicknamed \"Kira,\" he uses the Death Note to create his ideal world of justice under him; its new God. Though he looks frail, Light is an extremely athletic person, with an aptitude to find an opponent's weak point. He is a genius, which adds to his notion that only he is fit to judge humanity and steer it on a proper moral course."
        },
        {
            "mal_id": 27,
            "url": "https://myanimelist.net/character/27/Killua_Zoldyck",
            "images": {
                "jpg": {
                    "image_url": "https://cdn.myanimelist.net/images/characters/2/327920.jpg"
                },
                "webp": {
                    "image_url": "https://cdn.myanimelist.net/images/characters/2/327920.webp",
                    "small_image_url": "https://cdn.myanimelist.net/images/characters/2/327920t.webp"
                }
            },
            "name": "Killua Zoldyck",
            "name_kanji": "キルア=ゾルディック",
            "nicknames": [
                "Kil"
            ],
            "favorites": 95358,
            "about": "Age: 12 (Beginning), 14-15 (Current)\nBirthday: July 7th (2011), June 15th (1999)\nHeight: 158 cm \nWeight: 45 kg\nEye Color: Blue\nBlood Type: A\nOccupation: Assassin (Formerly), Hunter\nNen Type: Transmutation\nEquipment: Skateboard, Yo-Yos\nAbilities: \n\nKillua Zoldyck is the third child of Silva and Kikyo Zoldyck and the heir (former) of the Zoldyck Family. He is the deuteragonist of the series Hunter x Hunter.\n\nKillua is introduced as a character similar to Gon: cheeky, cheerful, and full of bad ideas. However, contrasting Gon's politeness, Killua can be pretty rude to others, mostly strangers and older people. He is also one of the quickest-thinking characters and often analyzes a situation with great ease and accuracy. Despite his young age, his way of thinking, knowledge, and pragmatism give him the attitude of an adult. He is initially very confident about his abilities and able to gauge other people's abilities accurately.\n\nA stark contrast to his best friend Gon, Killua is highly mature in both thinking and emotion. He can keep his anger in check and maintain rationality better than Gon even when facing a terrifying experience.\n\n\n\nCharacter Background:\n\nTimeline:\n\nHunter Exam Arc:\n\nZoldyck Family Arc:\n\nHeavens Arena Arc:\n\n\nYorknew City Arc:\n\n\nGreed Island Arc:\n\n\n\nChimera Ant Arc:\n\n\n\n\nElection Arc:\n\n\n(Source: Hunterpedia Wiki)"
        },
        {
            "mal_id": 35252,
            "url": "https://myanimelist.net/character/35252/Rintarou_Okabe",
            "images": {
                "jpg": {
                    "image_url": "https://cdn.myanimelist.net/images/characters/6/122643.jpg"
                },
                "webp": {
                    "image_url": "https://cdn.myanimelist.net/images/characters/6/122643.webp",
                    "small_image_url": "https://cdn.myanimelist.net/images/characters/6/122643t.webp"
                }
            },
            "name": "Rintarou Okabe",
            "name_kanji": "岡部 倫太郎",
            "nicknames": [
                "Hououin Kyouma",
                "Okarin",
                "Mad Scientist"
            ],
            "favorites": 94078,
            "about": "Age: 18 (Steins;Gate), 19 (Steins;Gate 0)\nBirthdate: December 14, 1991 (Sagittarius)\nBlood Type: A\nHeight: 177 cm (5'10\")\nWeight: 59kg\nAffiliations: Future Gadget Lab\nOccupation: University Student\n\nRintaro Okabe (岡部 倫太郎 Okabe Rintarō?), often nicknamed Okarin (オカリン) or Hououin Kyouma (鳳凰院凶真), is a self-proclaimed mad scientist and the main protagonist of the Steins;Gate series.\n\nOkabe is a theatrical and eccentric individual. He is a self-proclaimed mad scientist, who likes to assume his \"true name\" \"Kyouma Hououin\" (鳳凰院凶真, Hououin Kyouma), and often uses this to introduce himself to others. Usually, people do not care and instead address him by his actual name or by 'Okarin' (his nickname), much to his chagrin.\n\nOkabe is also socially inept; his social skills were so poor that Kurisu considers the childlike Mayuri to be usual by comparison. However, he isn't hesitant to lend a helping hand to people whom he'd never met. Although very intelligent, Okabe is easily deceived by others.\n\nOkabe likes to pose as an agent working against a specific \"Organization,\" which he suggests is always after him, as he believes this kind of image gives him an excellent and mysterious aura. However, this seems to disappear as the story progresses, with SERN likely replacing the \"Organization's\" villainous image. He usually gives off the impression of being delusional and paranoid, displaying eccentric mannerisms such as talking to himself on the phone and engaging in fits of maniacal laughter.\n\n\n\nCharacter Background:\n\nTimeline:\n\n\n\n\n\n\n\n\n\n(Source: Steins;Gate Wiki, Wikipedia)"
        },
        {
            "mal_id": 11,
            "url": "https://myanimelist.net/character/11/Edward_Elric",
            "images": {
                "jpg": {
                    "image_url": "https://cdn.myanimelist.net/images/characters/9/72533.jpg"
                },
                "webp": {
                    "image_url": "https://cdn.myanimelist.net/images/characters/9/72533.webp",
                    "small_image_url": "https://cdn.myanimelist.net/images/characters/9/72533t.webp"
                }
            },
            "name": "Edward Elric",
            "name_kanji": "エドワード・エルリック",
            "nicknames": [
                "Ed",
                "Fullmetal Alchemist",
                "Hagane no shounen",
                "Chibi",
                "Pipsqueak"
            ],
            "favorites": 86997,
            "about": "Age: 15-16 (series), 18 (movie, end of the series)\nBirthday: 1899\nBirthplace: Resembool, Amestris\nFamily: Alphonse Elric (brother), Trisha Elric (mother, deceased), Van Hohenheim (father)\nAffiliations: State Military, Winry Rockbell, Pinako Rockbell, Izumi Curtis (teacher), Roy Mustang (Commander)\nSpecies: Human\nOccupation: State Alchemist\nAbilities: Alchemy, Martial Arts\nWeapon: Alchemy, Automail arm and leg\n\nEdward \"Fullmetal Alchemist\" Elric is a young alchemical prodigy. He is the youngest State Alchemist ever to be recognized by the Amestris State Military, having received the title at the age of 12. Ed's primary motivation throughout the series is to return his younger brother, Alphonse, to his original body, which was lost in a failed human transmutation. Edward, despite his occasional bouts of immaturity, is a selfless boy who gains a reputation as a \"hero of the people\" throughout his youth. Notably, he doesn't seem concerned about returning his own arm and leg, instead focusing entirely on Al's suffering.\n\nEdward is small for his age, standing at only 149 cm (4'11\"), however, his body is that of an experienced martial artist, with noticeable muscles and a wealth of agility. Although he lacks both his right arm and left leg, Ed's ability to fight is not impaired and is in fact improved, as he will often use alchemy to cause his metal arm to partly transform into a blade or shield. His heavy automail limbs are considered by him to be the very best in Amestris. They were made by his childhood friend, Winry Rockbell, and she is constantly working on them. He is able to think quickly, even in desperate situations, though can still be frightened into paralysis. These qualities, combined with his alchemical powers and physical strength, make him a formidable fighter.\n\nBorn to Trisha Elric and Van Hohenheim of Resembool in the winter of 1899, Edward's first few years were relatively happy; but after the sudden departure of his father during the lad's formative years, Ed was left with his mother and younger brother Alphonse as his only family. The three Elrics lived in peace in the rural village and the boys began displaying a remarkable talent for alchemy at a young age, much to the joyful astonishment of his mother. However, early in the year 1904, Trisha contracted an illness that had been spreading in the area and died, leaving her two sons orphaned. Even while mourning, mired in grief, Edward vowed to his brother that the two of them would find a way to bring their dead mother back to life with the power of alchemy.\n\nEdward and Alphonse spent the next few years living on their own in the Elric family home, supported by their close childhood friend Winry Rockbell and her grandmother Pinako, and pursuing the alchemical knowledge necessary for their planned resurrection. Although they had gained a great deal of information and comprehension regarding the extended basics of the craft, before long it became apparent to the young prodigies that there was only so far they could go while being self-taught. In a stroke of good fortune, Resembool was visited by an exceptionally skilled alchemist named Izumi Curtis who, after some persuasion, agreed to take the Elric brothers on as her apprentices provided they pass a preliminary test. After they do, the Elric brothers were subjected to Izumi's intensive alchemy and martial arts training, growing significantly in both mind and body and gaining a great deal of alchemical knowledge before returning to Resembool. \n\nThough instructed specifically by Izumi to understand that death is an irreversible part of the flow of the world and that acceptance of such is important to the \"One is All, All is One\" concept, the boys dove headlong into their plan to resurrect their mother upon their homecoming, having advanced their knowledge while abroad and discovered the basics of a forbidden practice called Human Transmutation.\n\nDevising a Human Transmutation Circle, amassing the elemental ingredients for an adult human body and offering their own blood as soul and biological data, the boys secretly initiated the Human Transmutation in their home. Unfortunately, the Human Transmutation resulted in a Rebound.\n\nAlphonse and Edward were pulled into The Gate. Encountering the mysterious being called Truth, Edward was stripped of his left leg in exchange for crossing into God's domain and peeking at the Gate's vast wealth of alchemical knowledge. Maimed and bleeding, Edward was returned to the human dimension to find that Alphonse had not yet returned from his disappearance into the Gate, that the mother they had attempted to revive was a grotesque mass of organs only capable of sustaining life for a few moments and that his own sojourn into the Gate had granted him the curious ability to perform transmutations merely by clapping his hands together, without the aid of a Transmutation Circle - in the same style used by Izumi. Desperate to at least have his brother by his side, Edward willfully performed another Human Transmutation to call him back, this time sacrificing his right arm in exchange for Al's soul, which he bound alchemically to an antique suit of armor with a Blood Rune before passing out from severe blood loss. Alphonse carried Ed to the Rockbell house, where a shocked Pinako and Winry performed emergency surgery to save the young boy's life.\n\nOn the night of the failed transmutation. Lt. Colonel Flame Alchemist Roy Mustang came to the Rockbell's in response to a letter that Edward and Alphonse had sent him in the mail asking about their Father. He was shocked at the fact that the two boys had tried human alchemy and survived, and informed them that they could become state alchemist and maybe one day find a way to return their bodies to the way they were. Desperate to get His younger brother's body back, Edward asked the Rockbells to give him prosthetic limbs called automail. Though they warned him the surgery would be painful, he said the pain was nothing compared to what his brother had given up. He only took a year to adapt to the automail at age 11 when it took most adults three years."
        },
        {
            "mal_id": 17,
            "url": "https://myanimelist.net/character/17/Naruto_Uzumaki",
            "images": {
                "jpg": {
                    "image_url": "https://cdn.myanimelist.net/images/characters/2/284121.jpg"
                },
                "webp": {
                    "image_url": "https://cdn.myanimelist.net/images/characters/2/284121.webp",
                    "small_image_url": "https://cdn.myanimelist.net/images/characters/2/284121t.webp"
                }
            },
            "name": "Naruto Uzumaki",
            "name_kanji": "うずまき ナルト",
            "nicknames": [
                "Nine-Tails Jinchuuriki"
            ],
            "favorites": 83513,
            "about": "Age: 12-13 (Naruto part I), 15-17 (part II), 19 (The Last: Naruto the Movie), 27 (Naruto epilogue), 32 (Boruto: Naruto the Movie)\nBirthday: October 10\nBlood type: B\nHeight: 145–147 cm (I), 166 cm (II), 174 cm (The Last: Naruto the Movie), 180 cm (Boruto: Naruto the Movie)\nWeight: 41–44 kg (I), 52 kg (II), 56 kg (The Last: Naruto the Movie), 66 kg (Boruto: Naruto the Movie)\nFavorite food: Ichiraku ramen\n\nBorn in Konohagakure, a ninja village hidden in the leaves, Naruto Uzumaki was destined for greatness. When born, a powerful nine-tailed demon fox attacked his village. With a wave of its tail, the demon fox could raise tsunamis and shatter mountains. In a valiant attempt to save the village from destruction, the Fourth Hokage, the leader of the Hidden Leaf Village, sealed the demon fox within Naruto's newborn body. This was his final act, for the battle with the fox cost him his life.\n\nDespite the Fourth Hokage's dying wish that Naruto be viewed as a hero for serving as the container for the demon (a Jinchuuriki) the adult villagers of Konoha harbored a fierce hatred for him, with many believing that Naruto and the demon were one and the same. Cast aside as an inhuman monster, Naruto was outcast and ostracized by the villagers for reasons he could not understand. The children his age could only ever follow their parents' example; and they too came to harbor a fierce hatred for Naruto.\n\nNaruto eventually came to accept that he would live and die alone, and his external response was to perform harmless pranks on the village. Coy, raffish and full of life, Naruto soon came to display a somewhat unexpected determination to succeed and be accepted by others. Upon being assigned to \"Team Seven\" as a Genin-ranked ninja, his true potential soon became outwardly apparent.\n\nVowing to become Hokage one day and using his will to never give in, Naruto saves the village from invading forces and earns his acceptance. Eventually, Naruto learns to harness the power of the Demon Fox sealed inside him to perform acts of strength far beyond what any other human is capable of.\n\nIn all, Naruto is an admirable character whose sheer determination to succeed despite the odds, earns him respect and devotion from his fellow villagers."
        }
    ]
}